Autodesk.Revit.DB.RenderNode
This is the base class of all render nodes in a model-exporting process.
Remarks:
A node can be both geometric (such as an element, light, etc.) or non-geometric (e.g. material).
Some types of nodes are container modes, which include other render nodes.
Since:
2014